{
  "document_title": "Barcode and QR Code.",
  "content": [
    {
      "type": "section",
      "title": "Barcode and QR Code Overview.",
      "content": [
        {
          "type": "info",
          "text": "We understand that large lists can be daunting, and manually searching for an item can be a very time-consuming task. Barcodes and QR Codes can be used to streamline your workflow, making searching for an item effortless. Eptura Asset has multiple types of codes to cater to your needs, and you can do everything from simply searching for an asset, to starting an inspection plan on the spot."
        },
        {
          "type": "info",
          "text": "Let’s look at the different barcodes and QR Codes available:."
        },
        {
          "type": "info",
          "text": "Barcodes for Assets and Parts."
        },
        {
          "type": "info",
          "text": "QR Codes for Work Request."
        },
        {
          "type": "info",
          "text": "Operator Companion App QR Codes."
        }
      ]
    },
    {
      "type": "section",
      "title": "Barcodes for Assets and Parts.",
      "content": [
        {
          "type": "info",
          "text": "All Assets and Parts automatically get a barcode, meaning that all new Assets and Parts created in the application will be assigned a system generated barcode by default.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/1. jpg"
          ]
        },
        {
          "type": "info",
          "text": "Below is an example of a Barcode from an Asset. Information displayed on this Barcode includes the Asset ID, Description, and the Asset Tag ID.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/2. png"
          ]
        },
        {
          "type": "info",
          "text": "Below is an example of a Barcode from a Part. Information displayed on this Barcode includes the PartID, Description, Bin Location, Part Type, and the Part Association ID.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/3. png."
          ]
        },
        {
          "type": "info",
          "text": "These Barcodes can be scanned through the app to quickly access the Asset or Part associated to the Barcode."
        },
        {
          "type": "info",
          "text": "Although barcodes are automatically generated, existing barcodes can also be associated to the Asset or Part, in addition to the system generated barcodes."
        },
        {
          "type": "info",
          "text": "Learn more about our Barcode Client, which is a cloud printing service that needs access to the barcode printer and the internet and will need to always remain running."
        }
      ]
    },
    {
      "type": "section",
      "title": "QR Codes for Work Requests.",
      "content": [
        {
          "type": "info",
          "text": "Tagging an Asset with a QR Code will give Requesters a direct link to your Request Portal with the Asset information already filled out. This allows for ease of use, eliminating the need to manually search for the Asset within the application.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/4. jpg."
          ]
        },
        {
          "type": "info",
          "text": "Below is an example of a Work Request QR Code, along with the Request Portal displayed on a mobile device. This QR code can be scanned from your camera app, which will direct you to the Request Portal.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/5. png."
          ]
        },
        {
          "type": "info",
          "text": "Learn more about how to set up the QR Codes for the requests."
        }
      ]
    },
    {
      "type": "section",
      "title": "Operator Companion Application QR Codes.",
      "content": [
        {
          "type": "info",
          "text": "The Operator Companion App QR codes are used on Assets that have an Inspection Plan associated to it. These QR codes are placed directly on your Assets. By scanning this code from your device, you are navigating directly to the inspection plan through the Operator Companion Application, allowing you to complete the inspection directly from the Asset location.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/6. jpg."
          ]
        },
        {
          "type": "info",
          "text": "Below are examples of QR Codes associated to an asset. Information displayed on the QR code includes the Asset ID and Description.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/7. png.",
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/8. png."
          ]
        },
        {
          "type": "info",
          "text": "This QR code can be scanned from your camera app, which will direct you to the Operator Companion where inspections can be started and work orders can be generated."
        }
      ]
    },
    {
      "type": "section",
      "title": "Set up the Barcode Client.",
      "content": [
        {
          "type": "info",
          "text": "The Barcode client is a cloud printing service that needs access to the barcode printer and the internet and will need to always remain running. This article will walk you through the setup, and accessing the Barcode Client."
        },
        {
          "type": "info",
          "text": "The Barcode Client lets you:."
        },
        {
          "type": "info",
          "text": "Download and install the Barcode Client."
        },
        {
          "type": "info",
          "text": "Log into the Barcode Client."
        },
        {
          "type": "info",
          "text": "Find the Barcode Client in Classic."
        },
        {
          "type": "info",
          "text": "Select which printer will be used to print Barcodes."
        }
      ]
    },
    {
      "type": "section",
      "title": "Download and Install the Barcode Client.",
      "content": [
        {
          "type": "info",
          "text": "Before you download the Barcode Client, contact your IT Administrator to make sure you are set up as a local admin on your computer. When this is completed, you will be able to install the Barcode Client software on your computer."
        },
        {
          "type": "step",
          "text": "1. From the menu, click Settings."
        },
        {
          "type": "step",
          "text": "2. Under the Tools and Support section, click Barcode Client."
        },
        {
          "type": "info",
          "text": "The Setting Up the Barcode Client screen displays.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/9. png."
          ]
        },
        {
          "type": "step",
          "text": "3. Click the Download button. The Barcode Client is downloaded as a file called MPlusBarcodeClientInstall. msi."
        },
        {
          "type": "step",
          "text": "4. Navigate to your download folder and then double click the filename to install."
        },
        {
          "type": "info",
          "text": "The ManagerPlus Barcode Print wizard dialog displays.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/10. png."
          ]
        },
        {
          "type": "step",
          "text": "5. Click the Next > button and the Select Installation Folder dialog displays.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/11. png."
          ]
        },
        {
          "type": "step",
          "text": "6. Click the Next > button and the Confirm Installation dialog displays.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/12. png."
          ]
        },
        {
          "type": "step",
          "text": "7. Click the Next > button and the Barcode Client is installed."
        }
      ]
    },
    {
      "type": "section",
      "title": "Log into the Barcode Cilent.",
      "content": [
        {
          "type": "info",
          "text": "Log in using your Company Code, Username, and Password.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/13. png."
          ]
        },
        {
          "type": "info",
          "text": "The Company Code is the first part of your Eptura Asset's URL. For example:."
        },
        {
          "type": "info",
          "text": "https://testcompany. managerpluscloud. com/."
        },
        {
          "type": "info",
          "text": "Then your company's code is testcompany."
        },
        {
          "type": "info",
          "text": "After successfully logging in, click the Add button to add a Barcode Printer.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/14. png."
          ]
        },
        {
          "type": "info",
          "text": "Add a system printer and customize your barcode settings.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/BarcodeandQRCode/15. png."
          ]
        },
        {
          "type": "info",
          "text": "After saving, you are ready to go."
        }
      ]
    }
  ]
}