{
  "document_title": "Collaboration Center.",
  "content": [
    {
      "type": "section",
      "title": "Collaboration Center.",
      "content": [
        {
          "type": "info",
          "text": "We believe it vitally important to collaborate with our clients,  to ensure the success of both our clientele as well as our products. To that end, we invite you to take advantage of all the features offered in the Collaboration Center."
        },
        {
          "type": "step",
          "text": "1. Access the center, click Collaboration Center  icon at the top, right hand side of the screen.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/CollaborationCenter/icon/1. png."
          ]
        }
      ]
    },
    {
      "type": "section",
      "title": "Features.",
      "content": [
        {
          "type": "info",
          "text": "We would love to hear from you, our customers, on what’s important to you so we can build features that will address your needs and provide a delightful user experience."
        },
        {
          "type": "step",
          "text": "1. Suggest Ideas - this opens the Feature Roadmap to the Ideas Board and this is where you can click the Submit Idea button and then complete the short form."
        },
        {
          "type": "step",
          "text": "2. Upcoming Features - this opens the Feature Roadmap to display the features Under Construction."
        },
        {
          "type": "step",
          "text": "3. New Features - this opens the Feature Roadmap to display the features Released."
        },
        {
          "type": "info",
          "text": "If you want more details then head over to the What's New area to read the latest release notes, also we have on-demand training, and our Eptura Blog has many posts to read."
        }
      ]
    },
    {
      "type": "section",
      "title": "Lifetime Work Statistics.",
      "content": [
        {
          "type": "info",
          "text": "If you are curious about statistics then look at the charts that show the Lifetime Work of your company, including Preventative, Predictive and Repair Work Orders, your Personal Lifetime Work, and your Total Labor Hours.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/CollaborationCenter/2. png."
          ]
        }
      ]
    },
    {
      "type": "section",
      "title": "Quick Links.",
      "content": [
        {
          "type": "info",
          "text": "You will find at the bottom of the screen the quick links to:."
        },
        {
          "type": "info",
          "text": "Contact Support - this opens our Eptura Customer Hub."
        },
        {
          "type": "info",
          "text": "Knowledge Center - this opens the Eptura Knowledge Center which you have are already found."
        },
        {
          "type": "info",
          "text": "Connectors & Integrations - this opens the Eptura EAM/CMMS Integration, Connectors and API page and for the knowledge articles head over to Connectors."
        },
        {
          "type": "info",
          "text": "API Documentation - this opens the auto-generated API V2 Documentation."
        }
      ]
    }
  ]
}