{
  "document_title": "Inspections Admin Settings.",
  "content": [
    {
      "type": "section",
      "title": "Inspections Admin Settings."
    },
    {
      "type": "section",
      "title": "Set up Inspections.",
      "content": [
        {
          "type": "info",
          "text": "These are the default settings that appear when creating an Inspection Template. They will save you time when creating an Inspection Template as the default settings automatically populate into the Form Builder."
        },
        {
          "type": "info",
          "text": "In the example below, notice how Pass/Fail is the default  sign off style when creating a new Inspection Template. This is configured in Inspection Settings.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/InspectionsAdminSettings/1. png."
          ]
        }
      ]
    },
    {
      "type": "section",
      "title": "Access Inspection Settings.",
      "content": [
        {
          "type": "step",
          "text": "1. Navigate to Settings > Module Settings > Inspection Settings. The Inspection Settings screen displays."
        }
      ]
    },
    {
      "type": "section",
      "title": "Inspection Defaults.",
      "content": [
        {
          "type": "info",
          "text": "Inspection defaults automatically populate preferred settings into the Form Builder when creating an Inspection Template.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/InspectionsAdminSettings/2. png."
          ]
        },
        {
          "type": "step",
          "text": "1. Trigger Work Order: Choose between a Failure or Critical Failure as the default to trigger a Work Order from an Inspection."
        },
        {
          "type": "step",
          "text": "2. Comments On Failures: Enable or disable comments from an Inspection Template."
        },
        {
          "type": "step",
          "text": "3. Sign Off Style (Button Names): Choose the default Sign Off style (Pass/Fail, Safe/Unsafe, Operable/Inoperable)."
        },
        {
          "type": "step",
          "text": "4. Visible in OC App: Make the Inspection visible in Operator Companion mobile application."
        },
        {
          "type": "step",
          "text": "5. Certification Text: This text automatically populates to any new inspection template."
        },
        {
          "type": "step",
          "text": "6. Sign Off Text: This text automatically populates to any new inspection template."
        }
      ]
    },
    {
      "type": "section",
      "title": "Operator Companion App.",
      "content": [
        {
          "type": "info",
          "text": "The Operator Companion allows users to perform inspections from a mobile device.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/InspectionsAdminSettings/3. png."
          ]
        },
        {
          "type": "step",
          "text": "1. App URL: The URL required to access Operator Companion from a mobile device."
        },
        {
          "type": "step",
          "text": "2. Enable QR Codes: Enable QR code feature to print QR codes for the Operator Companion application."
        },
        {
          "type": "step",
          "text": "3. Inspection History Load Limit: Set the ampount of inspection history available for operators to view from the Operator Companion application."
        }
      ]
    },
    {
      "type": "section",
      "title": "Inspection - Work Order Tie.",
      "content": [
        {
          "type": "info",
          "text": "Inspection Templates automatically create Service Tasks That are used to perform an inspection on a Work Order.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/InspectionsAdminSettings/4. png."
          ]
        },
        {
          "type": "step",
          "text": "1. Default Service Class: Define which service class the tasks generated from an inspection template will belong to."
        }
      ]
    },
    {
      "type": "section",
      "title": "Work Order Defaults.",
      "content": [
        {
          "type": "info",
          "text": "These are the default values for Work Orders Generated by Inspection defects.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/InspectionsAdminSettings/5. png."
          ]
        },
        {
          "type": "step",
          "text": "1. Work Type: Select the default Work Type for Work Orders generated by inspection defects."
        },
        {
          "type": "step",
          "text": "2. Priority: Set the default Work Order priority for Work Orders generated by inspection defects."
        },
        {
          "type": "step",
          "text": "3. Set WO Due Date: Define how many days after creation a Work Order is due."
        }
      ]
    },
    {
      "type": "section",
      "title": "Work Order Inspections.",
      "content": [
        {
          "type": "info",
          "text": "Settings for Inspections generated from a Work Order.",
          "image_path": [
            "https://github. com/SavvyGaikwad/img/blob/main/InspectionsAdminSettings/6. png."
          ]
        },
        {
          "type": "step",
          "text": "1. New Inspection Defects Option: Define whether new inspection defect should be added to a new or existing work order, or if the user has to option to choose to save the defects for later."
        }
      ]
    }
  ]
}