{
  "document_title": "Inventory Import Template Data.",
  "content": [
    {
      "type": "section",
      "title": "Inventory Import Template Data."
    },
    {
      "type": "section",
      "title": "General Information.",
      "content": [
        {
          "type": "info",
          "text": "Do not change the column headers in Row 1 as this is used to complete the upload."
        }
      ]
    },
    {
      "type": "section",
      "title": "Data Columns.",
      "content": [
        {
          "type": "info",
          "text": "The table below lists the columns and which columns are required or optional."
        },
        {
          "type": "info",
          "text": "Table 1:\nColumn Name | Column Required | Max Length | Notes\nSite Name | Yes | 50 | Determined from initial sale. Enter Company Name or division if multi-sites were purchased. Warehouse | Yes\nPart # | Yes | 36 | Each must be unique. Choose either the actual Part ID for this field, an assigned company number, or unique name. Description | Yes | 100 | Description of the part. Part Type | Yes | 24 | Part type is a way to group similar parts or the field can be used to show what the part fits on. Status | Yes | 24 | Status of the part when purchased, New, Rebuilt, Used, Stock, Non-Stock, etc. Unit of Measure | Yes | 24 | How the part is dispensed: Each, Gallons, Quarts, Ounces, Set, Pair, etc. Barcode # | 20\nBin Location | 24\nVendor ID | 24\nVendor Part # | 36\nEach Cost | The cost of the part. Enter only numbers, do not use currency symbols. Year\nBeginning Quantity | Yes | Quantity currently on hand. Level Min | This quantity triggers reorder notification. When inventory is less than the minimum, inventory reorder reports and purchase orders can be generated. Level Norm | This is the preferred normal stock quantity. Level Max | Tracks stock overages. When the maximum quantity is surpassed, the item is listed on the inventory overage report. Favorite | T/F | TRUE - Favorited items in a specific warehouse will be visible when looking at that warehouse. FALSE - Must go to the master parts list to see the part. Tracked | T/F | TRUE - Tracks consumption. Will not allow work orders to use part if inventory is empty. FALSE - Will not track consumption. Note\nCustom Fields 1 to 6 | User Defined Fields:\nPlease rename the field. For dropdown lists, the character limit is 24."
        }
      ]
    }
  ]
}