{
  "document_title": "Work Order Import Template Data.",
  "content": [
    {
      "type": "section",
      "title": "Work Order Import Template Data."
    },
    {
      "type": "section",
      "title": "General Information.",
      "content": [
        {
          "type": "info",
          "text": "Do not change the column headers in Row 1, as this is used to complete the upload."
        }
      ]
    },
    {
      "type": "section",
      "title": "Data Columns.",
      "content": [
        {
          "type": "info",
          "text": "The table below lists the columns and which columns are required or optional."
        },
        {
          "type": "info",
          "text": "Table 1:\nColumn Name | Column Required | Max Length | Notes\nWork order number | Yes | This is a unique identifier of a work order. Multiple work orders can be uploaded with the same work order number. Purpose | Yes | 100 | The purpose of creating the work order, e. g. Repairing car break. Asset | Yes - Conditional | The asset for which a work order will be created, e. g. Car. This is a conditional mandatory field; the condition here is that either asset or budget must be provided. If uploaded, then the asset must match the asset ID present in the system. Budget | Yes - Conditional | Eptura Asset allows users to keep track of their spending on assets, Work orders, Purchase orders using Budget accounts. Budget accounts belong to an entity. These budget accounts are referred to as Budget in Work Order. This is a conditional mandatory field; the condition here is that either budget or asset must be provided. If uploaded, it must:\nMatch budget accounts present in the system. Match the budget account for work order entity. Type | No | Type, also known as Work Type, categorizes the kind of work that will be done for the work order, such as preventive, corrective, inspection, and so on. We can set one of the work types as the default work type. If provided, this must match the work types present in the system. Work types are defined in Settings > Work Order Settings > Work Type. Priority | No | Priority helps to mark the urgency for a work order. Eptura Asset has the following priorities:\nMajor\nMinor\nNormal\nCritical\nIf provided, this must match the types of priorities present in the system. Status | No | Status helps to define the flow of work orders. Eptura Asset defines status, under active, completion, and inactive categories; also it lets you set the starting status, also known as default status. An example of statuses that can fall under the active category can be New, Reopened, Requires parts. If provided, this must match any of the status present in the system. These status can be configured in Settings > Work Order Settings > Workflow. Due Date | No | Date | This date specifies when the work order needs to be completed. The due dates must match the DD/MM/YYYY format. Eptura Asset will display a warning message if due date is 10 years before or after the current date. The due date needs to be greater than the work order created date. Vendor | No | By default, all listed vendors are treated as suppliers of parts to your organization and additionally:  \nEach vendor can be specified as an outside contractor, allowing you to assign work to them. Indicate which supplier is preferred for each of your parts and inventory items. Include a rating option, allowing you to rate each vendor from 1-5 stars. Vendors belong to an entity\nIf uploaded, this must match the vendors in the system and the vendor must belong the entity of the work order. Assignee | No | Assignee is the user to whom the work order can be assigned for completion. This user belongs to an entity. If uploaded, this must match with any of the User's ID in the system and they must belong to the work order entity. Customer | No | Work orders and invoices can be associated with a customer. This customer user belongs to an entity. If uploaded, this must match with any of the customers in the system and that customer user must belong to the work order entity. Created Date | No | Date | This field specifies the work order creation date. The created date must match the DD/MM/YYYY format. Eptura Asset will display a warning message if the created date is 10 years before the current date. The created date cannot be a future date\nCompleted Date | No | Date | This field specifies the work order completed date. The completed date must match the DD/MM/YYYY format. Eptura Asset will display a warning message if a completed date is 10 years before or after the current date. For a work order with completed status, the completed date cannot be a future date. Custom field | No | Eptura Asset lets you add custom fields that can be filled in when creating assets, work orders, etc. The following are the types of custom fields supported:\nText: Any character, letter, symbol, or number, can be typed in this field. Check box: Creates a Yes/No style check box. Integer: Only numbers can be entered. Decimal: Numbers with a decimal point can be entered. Date:  MM/DD/YY\nLookup: Creates a drop-down field, containing the options that can be selected from. Contact: Creates a drop-down field that brings up the list of Employees, Vendors, Customers, Users. Currency: Numbers entered will be preceded by your country's currency symbol. Numbers, symbols, and characters allowed. If text length beyond 250 characters, then - ‘Value must be no longer than 250 characters. ’\nIf text box field has a status set in settings and text value is not uploaded, then - ‘Custom field ABC requires a values. ’\nIf default value not customized and value uploaded is not a Yes or No, then a validation message in yellow - ‘Value is not a valid Yes or No, so it will be saved as No. ’\nWork description | No | 100 | This is a text field to provide any description related to the work order. Part | Yes - Conditional | If this field is present in the work order section, then this is a combination of Part ID and Description. This is a conditional mandatory field, and the Part ID is needed if any other part fields are uploaded. Allow only stocked and non-stocked part types. Cost | No | 16 | This field provides the cost of the part needed to complete the work order. This field can be integer or floating decimals. 2 digits are allowed post-decimal for cost. Length of digits with/without decimal will be 16. Quantity | No | Quantity of the part uploaded. This field can be integer or floating decimals. No limit on the length of the digits with/without decimal. Budget | No | The budget that is spent on the parts to complete the work order. The budget of the work order will also be applied to the parts record of the work order. Task Code | No | Service task code of the task performed using the part. If this field is uploaded, then it must match one of the service task codes. Warehouse | No | This field tells the warehouse of the part. If this field is uploaded, then it must match the warehouse with respect to entity selected for work order. Labor contact | No | This field provides the name of the labor contact who will work on the work order. If any of the remaining fields are uploaded (Labor Hour, Labor Task, Labor Rate and Labor Code) then this field is required. Labor contact must belong the work order entity. Labor rate | No | This field provides the rate/amount configured per hour for the labor/person who work on the work order. This can be integer or floating digits. No other symbols or text apart from currency symbols allowed. Labor code | No | This field provides the amount configured per hour for the labor/person working on the work order. This can be integer or floating digits. No other symbols or text apart from currency symbols allowed. Labor hours | No | This field specifies the hours and minutes worked by the labor on a task. Hours - Only integers between 0 - 99 will be considered valid. Minutes - Only integers between 0-59 will be considered valid. Labor cost | No | Labor Cost = Labor rate * Labor hours\nLabor Cost = Labor code * Labor hours\nTask Code | No | Service task code of the task performed by the labor."
        }
      ]
    }
  ]
}